Repository: Jutaosay/openclaw_for_windows
Catalog: src/OpenClaw/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

source: Reload
zh_cn: 刷新

source: Stop
zh_cn: 停止

source: Open in Browser
zh_cn: 在浏览器中打开

source: Settings
zh_cn: 设置

source: Clear Session
zh_cn: 清除会话

source: Close
zh_cn: 关闭

source: Retry
zh_cn: 重试

# DevTools
source: Developer Tools
zh_cn: 开发者工具

# DiagnosticsTitle
source: Diagnostics
zh_cn: 诊断

source: Select environment
zh_cn: 选择环境

# MainModelLabel
source: MODEL :
zh_cn: 模型：

# MainStatusLabel
source: Status :
zh_cn: 状态：

# ThemeSystem
source: System theme
zh_cn: 系统主题

# ThemeLight
source: Light theme
zh_cn: 浅色主题

# ThemeDark
source: Dark theme
zh_cn: 深色主题

# StatusConnected
source: Connected
zh_cn: 已连接

# StatusLoading
source: Loading...
zh_cn: 加载中...

# StatusGatewayConnecting
source: Connecting to Gateway...
zh_cn: 正在连接网关...

# StatusReconnecting
source: Reconnecting...
zh_cn: 重新连接中...

# StatusAuthFailed
source: Authentication Failed
zh_cn: 身份验证失败

# StatusError
source: Connection Error
zh_cn: 连接错误

# StatusOffline
source: Offline
zh_cn: 离线

# StatusHeartbeatFailed
source: Gateway heartbeat lost - refreshing...
zh_cn: 网关心跳丢失，正在刷新...

# HeartbeatOk
source: HB OK
zh_cn: 心跳正常

# HeartbeatWait
source: HB WAIT
zh_cn: 心跳等待

# HeartbeatBlocked
source: HB BLOCK
zh_cn: 心跳阻塞

# HeartbeatFailed
source: HB FAIL
zh_cn: 心跳失败

# RecoveryConnecting
source: Connecting...
zh_cn: 连接中...

# RecoveryReconnecting
source: Reconnecting...
zh_cn: 重新连接中...

# RecoveryResyncing
source: Resyncing session...
zh_cn: 同步会话中...

# RecoveryRefreshing
source: Refreshing page...
zh_cn: 刷新页面中...

# RecoveryDegraded
source: Connection degraded
zh_cn: 连接质量下降

# RecoveryFailed
source: Recovery failed - manual action required
zh_cn: 恢复失败，需要手动操作

# SettingsTitle
source: Settings
zh_cn: 设置

source: Environment Name
zh_cn: 环境名称

source: Gateway URL
zh_cn: 网关 URL

source: Set as default
zh_cn: 设为默认

source: Add Environment
zh_cn: 添加环境

source: Remove Environment
zh_cn: 移除环境

source: Save
zh_cn: 保存

source: Cancel
zh_cn: 取消

# NoEnvironments
source: No environments configured. Add one to get started.
zh_cn: 尚未配置环境，请添加一个以开始使用。

# SettingsNavLanguage
source: Language
zh_cn: 语言

# SettingsNavEnvironments
source: Environments
zh_cn: 环境

# SettingsNavSessions
source: Sessions
zh_cn: 会话

# SettingsNavDevTools
source: Dev Tools
zh_cn: 开发工具

# SettingsLanguageDescription
source: Choose your preferred display language.
zh_cn: 选择你偏好的显示语言。

# SettingsLanguageSystem
source: System Default
zh_cn: 系统默认

# SettingsLanguageChineseSimplified
source: Simplified Chinese
zh_cn: 中文（简体）

# SettingsLanguageRestartHint
source: * Language change requires app restart.
zh_cn: * 语言切换需重启应用。

# SettingsEnvironmentsTitle
source: Gateway Environments
zh_cn: 网关环境

# SettingsEnvironmentsDescription
source: Manage your OpenClaw Control UI endpoints.
zh_cn: 管理你的 OpenClaw Control UI 入口。

# SettingsAddTooltip
source: Add
zh_cn: 添加

# SettingsRemoveTooltip
source: Remove
zh_cn: 移除

# SettingsEnvironmentPlaceholder
source: e.g. Production
zh_cn: 例如：Production

# SettingsControlUiUrlHint1
source: Use the public hosted Control UI page URL (`http://` or `https://`), not the Gateway WebSocket URL. If you connect through Cloudflare Tunnel or another reverse proxy, this should be the exact public origin exposed to the browser.
zh_cn: 请填写公开托管的 Control UI 页面地址（`http://` 或 `https://`），不要填写 Gateway WebSocket URL。如果你通过 Cloudflare Tunnel 或其他反向代理访问，这里应当是浏览器最终访问的公网 origin。

# SettingsControlUiUrlHint2
source: If the page loads but OpenClaw reports origin rejection, add this exact origin to `gateway.controlUi.allowedOrigins` and make sure the reverse proxy / Cloudflare Tunnel preserves the original host and scheme.
zh_cn: 如果页面能打开，但 OpenClaw 报告 origin rejection，请把这个精确 origin 加入 `gateway.controlUi.allowedOrigins`，并确认反向代理 / Cloudflare Tunnel 保留了原始 host 和 scheme。

# SettingsControlUiUrlHint3
source: For same-host VPS reverse proxies or Cloudflare Tunnel sidecars, current OpenClaw docs recommend `gateway.auth.mode: "token"` or `"password"` instead of `"trusted-proxy"`. Same-host loopback forwarding does not satisfy trusted-proxy auth.
zh_cn: 对于同机 VPS 反向代理或 Cloudflare Tunnel sidecar，当前 OpenClaw 文档更推荐 `gateway.auth.mode: "token"` 或 `"password"`，而不是 `"trusted-proxy"`。同机 loopback 转发不满足 trusted-proxy 验证。

# SettingsControlUiUrlHint4
source: If OpenClaw asks for device pairing, approve the pending request on the gateway host with `openclaw devices list` and `openclaw devices approve --latest`, then reconnect this desktop client.
zh_cn: 如果 OpenClaw 要求设备配对，请在网关主机上执行 `openclaw devices list` 和 `openclaw devices approve --latest`，然后再回到这个桌面客户端重连。

# SettingsApply
source: Apply
zh_cn: 应用

# SettingsValidationError
source: Validation Error
zh_cn: 校验错误

# SettingsSessionsTitle
source: Environment Sessions
zh_cn: 环境会话

# SettingsSessionsDescription
source: Each environment uses its own WebView2Data profile. Clear only the environment you want to reset.
zh_cn: 每个环境都会使用独立的 WebView2Data 配置文件。请只清除你想重置的那个环境。

# SettingsSessionReset
source: Session Reset
zh_cn: 会话重置

# SettingsClearSessionAction
source: Clear Session
zh_cn: 清除会话

# SettingsDevToolsTitle
source: Developer Tools
zh_cn: 开发工具

# SettingsDevToolsDescription
source: Diagnostics and debugging utilities.
zh_cn: 诊断与调试工具。

# SettingsEnableDevLog
source: Enable Dev Log
zh_cn: 启用开发日志

# SettingsEnableDevLogDescription
source: When enabled, the app writes verbose recovery telemetry and internal diagnostics to the log file.
zh_cn: 启用后，应用会把详细的恢复遥测和内部诊断信息写入日志文件。

# SettingsRunDiagnostics
source: Run Diagnostics
zh_cn: 运行诊断

# SettingsViewLogs
source: View Logs
zh_cn: 查看日志

# SettingsOpenDevTools
source: Open DevTools
zh_cn: 打开 DevTools

# SettingsSessionResetSelectEnvironment
source: Select an environment to clear its session.
zh_cn: 请选择要清除会话的环境。

# SettingsSessionResetCompleted
source: Cleared the saved session for '{0}'.
zh_cn: 已清除“{0}”的保存会话。

# SettingsValidationDefaultMessage
source: All environments must have a unique name and a valid http(s) Control UI URL. For Cloudflare Tunnel or reverse-proxy deployments, use the public HTTPS Control UI URL and keep gateway.controlUi.allowedOrigins in sync with its exact origin.
zh_cn: 所有环境都必须具有唯一名称和有效的 http(s) Control UI URL。对于 Cloudflare Tunnel 或反向代理部署，请使用公开的 HTTPS Control UI URL，并确保 `gateway.controlUi.allowedOrigins` 与其精确 origin 保持一致。

# SettingsValidationSelectEnvironment
source: Select an environment first.
zh_cn: 请先选择一个环境。

# SettingsValidationDuplicateEnvironment
source: Environment name '{0}' is duplicated. Session isolation now uses environment names, so each environment name must be unique.
zh_cn: 环境名称“{0}”重复。当前会话隔离依赖环境名称，因此每个环境名称都必须唯一。

# SettingsValidationEnvironmentNameRequired
source: Environment name is required.
zh_cn: 环境名称不能为空。

# SettingsValidationControlUiUrlRequired
source: Control UI URL is required.
zh_cn: Control UI URL 不能为空。

# SettingsValidationControlUiUrlAbsolute
source: Control UI URL must be an absolute URL.
zh_cn: Control UI URL 必须是绝对地址。

# SettingsValidationControlUiUrlWs
source: Use the Control UI page URL here (http/https), not the Gateway WebSocket URL (ws/wss).
zh_cn: 这里应填写 Control UI 页面地址（http/https），而不是 Gateway WebSocket 地址（ws/wss）。

# SettingsValidationControlUiUrlScheme
source: Control UI URL must use http or https.
zh_cn: Control UI URL 必须使用 http 或 https。

# SettingsGeneratedEnvironmentName
source: Environment {0}
zh_cn: 环境 {0}

# AppDisplayName
source: OpenClaw Manager
zh_cn: OpenClaw 管理器

source: Quick Commands
zh_cn: 快捷命令

# QuickStop
source: /stop - Stop generation
zh_cn: /stop - 停止生成

# QuickStatus
source: /status - Check status
zh_cn: /status - 查看状态

# QuickNew
source: /new - New conversation
zh_cn: /new - 新对话

# QuickQueue
source: /queue - Queue interrupt
zh_cn: /queue - 队列中断

source: Connection Issue
zh_cn: 连接问题

# AboutTitle
source: About
zh_cn: 关于

# AboutDescription
source: A native Windows management shell for OpenClaw Gateway, built with WinUI 3 and WebView2.
zh_cn: 基于 WinUI 3 与 WebView2 的 OpenClaw Gateway 原生 Windows 管理外壳。

# AboutRepository
source: GitHub Repository
zh_cn: GitHub 仓库

# AboutDevelopedBy
source: Developed by
zh_cn: 开发者：

# AboutCopyright
source: (C) 2026 Lanstack @openclaw. All rights reserved.
zh_cn: (C) 2026 Lanstack @openclaw. 保留所有权利。

# LogsTitle
source: Application Logs
zh_cn: 应用日志

source: Refresh logs
zh_cn: 刷新日志

source: Open log folder
zh_cn: 打开日志目录

# LogFileLabelFormat
source: Log: {0}
zh_cn: 日志：{0}

# LogShowingLastLinesFormat
source: (showing last 500 of {0} lines)
zh_cn: （显示最后 500 行，共 {0} 行）

# LogNotFoundToday
source: No log file found for today.
zh_cn: 今天没有找到日志文件。

# LogReadFailedFormat
source: Failed to read log: {0}
zh_cn: 读取日志失败：{0}

# DiagnosticWebView2RuntimeLabel
source: WebView2 Runtime
zh_cn: WebView2 运行时

# DiagnosticNetworkConnectivityLabel
source: Network Connectivity
zh_cn: 网络连接

# DiagnosticSessionStatusLabel
source: Session Status
zh_cn: 会话状态

# DiagnosticInstrumentationLabel
source: Runtime Instrumentation
zh_cn: 运行时观测

# DiagnosticWebViewRuntimeNotFound
source: WebView2 Runtime not found
zh_cn: 未找到 WebView2 运行时

# DiagnosticWebViewRuntimeNotFoundDetail
source: Please install the WebView2 Evergreen Runtime from https://developer.microsoft.com/en-us/microsoft-edge/webview2/
zh_cn: 请从 https://developer.microsoft.com/en-us/microsoft-edge/webview2/ 安装 WebView2 Evergreen Runtime。

# DiagnosticWebViewRuntimeCheckFailed
source: WebView2 Runtime check failed
zh_cn: WebView2 运行时检查失败

# DiagnosticWebViewRuntimeCheckFailedDetailFormat
source: Error: {0}. Please install the WebView2 Evergreen Runtime.
zh_cn: 错误：{0}。请安装 WebView2 Evergreen Runtime。

# DiagnosticNoGatewayUrlConfigured
source: No gateway URL configured.
zh_cn: 尚未配置网关 URL。

# DiagnosticNonLocalHttp
source: Control UI is configured over non-local HTTP.
zh_cn: Control UI 配置为非本地 HTTP。

# DiagnosticNonLocalHttpDetail
source: Current OpenClaw docs recommend HTTPS for remote browser access. gateway.controlUi.allowInsecureAuth is localhost-only and does not relax remote device identity requirements.
zh_cn: 当前 OpenClaw 文档建议远程浏览器访问使用 HTTPS。`gateway.controlUi.allowInsecureAuth` 仅适用于 localhost，不能放宽远程设备身份验证要求。

# DiagnosticControlUiReachableActive
source: Control UI reachable and Gateway session is active.
zh_cn: Control UI 可访问，Gateway 会话已激活。

# DiagnosticControlUiLoading
source: Control UI is still loading.
zh_cn: Control UI 仍在加载中。

# DiagnosticControlUiLoadingDetail
source: Reachability is known only after the hosted page reports its Gateway session state.
zh_cn: 只有在托管页面报告其 Gateway 会话状态之后，才能确认可达性。

# DiagnosticControlUiEstablishing
source: Control UI reachable, but the Gateway session is still being established.
zh_cn: Control UI 可访问，但 Gateway 会话仍在建立中。

# DiagnosticControlUiAuthRequired
source: Control UI reachable, but authentication is required.
zh_cn: Control UI 可访问，但需要身份验证。

# DiagnosticControlUiPairingRequired
source: Control UI reachable, but device pairing is required.
zh_cn: Control UI 可访问，但需要设备配对。

# DiagnosticControlUiPairingRequiredDetailFormat
source: {0} Approve the pending device request on the gateway host with `openclaw devices list` and `openclaw devices approve --latest` (or supply the current requestId).
zh_cn: {0} 请在网关主机上使用 `openclaw devices list` 和 `openclaw devices approve --latest`（或提供当前 requestId）批准待处理设备请求。

# DiagnosticControlUiOriginRejected
source: Control UI reachable, but the remote origin was rejected.
zh_cn: Control UI 可访问，但远程 origin 被拒绝。

# DiagnosticControlUiOriginRejectedDetailFormat
source: {0} Verify that the exact public HTTPS origin exposed by Cloudflare Tunnel or your reverse proxy is present in gateway.controlUi.allowedOrigins.
zh_cn: {0} 请确认 Cloudflare Tunnel 或反向代理暴露的精确公网 HTTPS origin 已加入 `gateway.controlUi.allowedOrigins`。

# DiagnosticControlUiGatewayWsFailing
source: Control UI reachable, but the Gateway WebSocket session is failing.
zh_cn: Control UI 可访问，但 Gateway WebSocket 会话失败。

# DiagnosticControlUiStateUnavailable
source: Control UI state is not available yet.
zh_cn: Control UI 状态暂时不可用。

# DiagnosticHttpReachableFormat
source: Control UI HTTP endpoint reachable ({0})
zh_cn: Control UI HTTP 端点可访问（{0}）

# DiagnosticHttpReachableDetail
source: HTTP reachability alone does not confirm the Gateway WebSocket/session is healthy. Load the page and re-run diagnostics for a session-aware result.
zh_cn: 仅 HTTP 可达并不能证明 Gateway WebSocket / 会话健康。请加载页面后重新运行诊断，以获得会话级结果。

# DiagnosticAccessRejectedFormat
source: Control UI reachable but access was rejected ({0})
zh_cn: Control UI 可访问，但访问被拒绝（{0}）

# DiagnosticAccessRejectedDetail
source: The endpoint is up, but authentication, password, token, origin validation, or trusted-proxy policy blocked the session. For Cloudflare Tunnel or reverse-proxy deployments, verify the public HTTPS origin in gateway.controlUi.allowedOrigins and prefer token/password auth over trusted-proxy on same-host loopback setups.
zh_cn: 端点本身可达，但身份验证、密码、token、origin 校验或 trusted-proxy 策略阻止了会话。对于 Cloudflare Tunnel 或反向代理部署，请确认公网 HTTPS origin 已加入 `gateway.controlUi.allowedOrigins`，并在同机 loopback 场景优先使用 token/password，而不是 trusted-proxy。

# DiagnosticGatewayWaitingApproval
source: Control UI reachable but the gateway is waiting for device approval (409)
zh_cn: Control UI 可访问，但 Gateway 正在等待设备批准（409）

# DiagnosticGatewayWaitingApprovalDetail
source: OpenClaw uses pairing for new browsers and devices. Approve the current request on the gateway host with `openclaw devices list` and `openclaw devices approve --latest`.
zh_cn: OpenClaw 对新浏览器和设备启用配对。请在网关主机上使用 `openclaw devices list` 和 `openclaw devices approve --latest` 批准当前请求。

# DiagnosticAuthRateLimited
source: Control UI auth is temporarily rate-limited (429)
zh_cn: Control UI 身份验证暂时被限流（429）

# DiagnosticAuthRateLimitedDetail
source: Wait for the limiter to cool down before retrying. Repeated bad tokens, passwords, or origin failures from the same browser can trigger a temporary lockout.
zh_cn: 请等待限流冷却后再重试。同一浏览器反复提交错误 token、密码或 origin 失败可能触发临时锁定。

# DiagnosticMethodRejected
source: Control UI reachable but the request method/path was rejected (405)
zh_cn: Control UI 可访问，但请求方法/路径被拒绝（405）

# DiagnosticMethodRejectedDetail
source: The server responded, but the Control UI route or reverse-proxy method handling may be misconfigured.
zh_cn: 服务器已响应，但 Control UI 路由或反向代理的方法处理可能配置错误。

# DiagnosticRedirectedFormat
source: Control UI reachable but redirected ({0})
zh_cn: Control UI 可访问，但发生重定向（{0}）

# DiagnosticRedirectedDetail
source: Verify the configured Control UI URL, gateway.controlUi.basePath, and any Cloudflare Tunnel or reverse-proxy rewrite rules.
zh_cn: 请确认配置的 Control UI URL、`gateway.controlUi.basePath` 以及 Cloudflare Tunnel / 反向代理的重写规则。

# DiagnosticPathNotFound
source: Control UI reachable but the requested path was not found (404)
zh_cn: Control UI 可访问，但请求路径不存在（404）

# DiagnosticPathNotFoundDetail
source: This often means the configured URL is missing the correct Control UI base path or the reverse proxy is forwarding the wrong route.
zh_cn: 这通常表示配置的 URL 缺少正确的 Control UI base path，或反向代理转发了错误路由。

# DiagnosticGatewayReturnedFormat
source: Gateway returned {0} {1}
zh_cn: Gateway 返回 {0} {1}

# DiagnosticGatewayReturnedServerFailureDetail
source: The remote endpoint is responding with a server-side failure before the hosted UI can establish its session.
zh_cn: 远程端点在托管 UI 建立会话之前就返回了服务端错误。

# DiagnosticGatewayReturnedDetail
source: The endpoint responded, but the Gateway session/auth state still needs to be verified from the hosted UI.
zh_cn: 端点已响应，但仍需从托管 UI 进一步确认 Gateway 会话 / 身份验证状态。

# DiagnosticGatewayTimeout
source: Gateway timeout
zh_cn: Gateway 超时

# DiagnosticGatewayTimeoutDetail
source: Connection timed out after 10 seconds.
zh_cn: 连接在 10 秒后超时。

# DiagnosticGatewayUnreachable
source: Gateway unreachable
zh_cn: Gateway 不可达

# DiagnosticNetworkProbeFailed
source: Network probe failed
zh_cn: 网络探测失败

# DiagnosticWebViewNotInitialized
source: WebView2 not initialized.
zh_cn: WebView2 尚未初始化。

# DiagnosticGatewaySessionAppearsActive
source: Gateway session appears active.
zh_cn: Gateway 会话看起来已激活。

# DiagnosticPageLoadedButEstablishing
source: The page is loaded, but the Gateway session is still being established.
zh_cn: 页面已加载，但 Gateway 会话仍在建立中。

# DiagnosticCurrentDeviceApprovalDetailFormat
source: {0} Approve the current device request with `openclaw devices approve --latest` or the explicit requestId.
zh_cn: {0} 请使用 `openclaw devices approve --latest` 或显式 requestId 批准当前设备请求。

# DiagnosticOriginRejectedFailDetailFormat
source: {0} Confirm that the public HTTPS Control UI origin is listed in gateway.controlUi.allowedOrigins.
zh_cn: {0} 请确认公网 HTTPS Control UI origin 已列入 `gateway.controlUi.allowedOrigins`。

# DiagnosticNoPageLoaded
source: No page loaded.
zh_cn: 尚未加载页面。

# BridgeGatewayUiLoaded
source: Gateway UI loaded.
zh_cn: Gateway UI 已加载。

# BridgePageLoading
source: Page is loading.
zh_cn: 页面加载中。

# BridgeTokenMissingSummary
source: Gateway shared token is missing.
zh_cn: Gateway 共享 token 缺失。

# BridgeTokenMissingDetail
source: Set the configured gateway token in Control UI settings. On the gateway host, check `openclaw config get gateway.auth.token`.
zh_cn: 请在 Control UI 设置中填入配置的网关 token。可在网关主机上执行 `openclaw config get gateway.auth.token` 检查。

# BridgeTokenMismatchSummary
source: Gateway token does not match.
zh_cn: Gateway token 不匹配。

# BridgeTokenMismatchDetail
source: The shared token does not match the gateway. Confirm the current token and, if needed, rotate or re-approve the paired device token.
zh_cn: 共享 token 与网关不一致。请确认当前 token；如有需要，轮换或重新批准已配对设备 token。

# BridgeDeviceTokenMismatchSummary
source: Stored device token is stale or revoked.
zh_cn: 保存的设备 token 已失效或被撤销。

# BridgeDeviceTokenMismatchDetail
source: Rotate or re-approve the device token on the gateway host with `openclaw devices list`, `openclaw devices rotate --device <deviceId> --role operator`, or remove and approve again.
zh_cn: 请在网关主机上使用 `openclaw devices list`、`openclaw devices rotate --device <deviceId> --role operator`，或删除后重新批准该设备 token。

# BridgeOriginRejectedSummary
source: Gateway rejected this origin.
zh_cn: Gateway 拒绝了此 origin。

# BridgeOriginRejectedDetail
source: Check gateway.controlUi.allowedOrigins and trusted proxy settings. For Cloudflare Tunnel, the exact public HTTPS origin must be allowed and the original host/scheme must be forwarded.
zh_cn: 请检查 `gateway.controlUi.allowedOrigins` 和 trusted proxy 设置。对于 Cloudflare Tunnel，必须允许精确的公网 HTTPS origin，并正确转发原始 host/scheme。

# BridgeTrustedProxyLoopbackSummary
source: Trusted-proxy auth was rejected from loopback.
zh_cn: Trusted-proxy 身份验证在 loopback 场景下被拒绝。

# BridgeTrustedProxyLoopbackDetail
source: Same-host loopback reverse proxies do not satisfy gateway.auth.mode: "trusted-proxy". Use token/password auth instead, or route through a non-loopback trusted proxy address.
zh_cn: 同机 loopback 反向代理不满足 `gateway.auth.mode: "trusted-proxy"`。请改用 token/password，或通过非 loopback 的 trusted proxy 地址接入。

# BridgeMixedAuthSummary
source: Gateway auth configuration is ambiguous.
zh_cn: Gateway 身份验证配置存在歧义。

# BridgeMixedAuthDetail
source: OpenClaw rejects mixed trusted-proxy + token configs. Remove the shared token or set gateway.auth.mode explicitly.
zh_cn: OpenClaw 会拒绝 trusted-proxy 与 token 混合配置。请移除共享 token，或显式设置 `gateway.auth.mode`。

# BridgeTrustedProxyHeaderSummary
source: Trusted-proxy identity headers are missing or invalid.
zh_cn: Trusted-proxy 身份头缺失或无效。

# BridgeTrustedProxyHeaderDetail
source: Check the proxy identity-header mapping and make sure the same headers are forwarded on both HTTP requests and WebSocket upgrades.
zh_cn: 请检查代理的 identity-header 映射，并确保 HTTP 请求和 WebSocket 升级都转发了相同头信息。

# BridgeTrustedProxyOriginSummary
source: Trusted-proxy auth passed, but the browser origin was rejected.
zh_cn: Trusted-proxy 身份验证通过，但浏览器 origin 被拒绝。

# BridgeTrustedProxyOriginDetail
source: Add the exact public browser origin to gateway.controlUi.allowedOrigins. Only use Host-header origin fallback if you intentionally accepted the security downgrade.
zh_cn: 请把精确的公网浏览器 origin 加入 `gateway.controlUi.allowedOrigins`。只有在明确接受安全降级时，才应启用 Host-header origin fallback。

# BridgeRateLimitedSummary
source: Gateway auth is temporarily rate-limited.
zh_cn: Gateway 身份验证暂时被限流。

# BridgeRateLimitedDetail
source: Wait and retry after the auth limiter cools down. Concurrent bad retries from the same browser can trigger "retry later".
zh_cn: 请等待限流冷却后再重试。同一浏览器并发的错误重试可能触发 “retry later”。

# BridgeInsecureHttpSummary
source: Control UI is blocked by insecure HTTP context.
zh_cn: Control UI 因不安全的 HTTP 上下文被阻止。

# BridgeInsecureHttpDetail
source: Use HTTPS (Tailscale Serve) or open the UI locally. gateway.controlUi.allowInsecureAuth is localhost-only and does not relax remote device identity requirements.
zh_cn: 请使用 HTTPS（如 Tailscale Serve）或仅在本地打开 UI。`gateway.controlUi.allowInsecureAuth` 只对 localhost 生效，不能放宽远程设备身份要求。

# BridgePairingSummary
source: Gateway requires device pairing.
zh_cn: Gateway 需要设备配对。

# BridgePairingDetail
source: Approve this device on the gateway host with `openclaw devices list` and `openclaw devices approve --latest` (or pass the current requestId), then reconnect.
zh_cn: 请在网关主机上执行 `openclaw devices list` 和 `openclaw devices approve --latest`（或传入当前 requestId）批准此设备，然后重连。

# BridgeAuthRequiredSummary
source: Gateway authentication is required.
zh_cn: Gateway 需要身份验证。

# BridgeAuthRequiredDetail
source: Sign in or provide a valid token/password for the remote gateway.
zh_cn: 请登录或为远程网关提供有效的 token/password。

# BridgeGatewaySessionNotConnectedSummary
source: Gateway session is not connected.
zh_cn: Gateway 会话未连接。

# BridgeGatewaySessionNotConnectedDetail
source: The page is loaded, but the Control UI still reports a connection problem.
zh_cn: 页面已加载，但 Control UI 仍报告连接存在问题。

# BridgeConnectingSummary
source: Connecting to Gateway...
zh_cn: 正在连接 Gateway...

# BridgeConnectingDetail
source: The Control UI is loaded and is still establishing its Gateway session.
zh_cn: Control UI 已加载，但仍在建立其 Gateway 会话。

# BridgeConnectedSummary
source: Gateway session appears active.
zh_cn: Gateway 会话看起来已激活。
